app/services/identity_service.rb

INSERT INTO `identities` (`address`, `public_key`, `created_at`, `updated_at`) VALUES ('0x60c2d5928e19d874c71b32f6048d851f98fb5340', '04aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa', '2026-04-16 00:36:33.957187', '2026-04-16 00:36:33.957187')
---
  def self.register(public_key:)
    address = derive_address(public_key)

    Identity.create!(
      address: address,
      public_key: public_key
    )

SELECT 1 AS one FROM `identities` WHERE `identities`.`address` = '0x60c2d5928e19d874c71b32f6048d851f98fb5340' LIMIT 1
---
  def self.exists?(address)
    Identity.exists?(address: address.downcase)