app/services/network_service.rb

  def self.deploy(name:, symbol:, decimals: 2, owner_address:,
                  capacity_imbalance_fee_divisor: 0,
                  default_interest_rate: 0,
                  custom_interests: false,
                  prevent_mediator_interests: false,
                  max_hops: 5)
    # Generate a deterministic address for the network (like a contract deployment)
    address = generate_network_address(name, symbol, owner_address)

    network = CurrencyNetwork.create!(
      address: address,
      name: name,
      symbol: symbol,
      decimals: decimals,
      capacity_imbalance_fee_divisor: capacity_imbalance_fee_divisor,
      default_interest_rate: default_interest_rate,
      custom_interests: custom_interests,
      prevent_mediator_interests: prevent_mediator_interests,
      max_hops: max_hops,
      owner_address: owner_address
    )

    # Record the deployment as an operation
    Operation.create!(
      operation_type: "deploy_network",
      module_name: "trustline",
      currency_network: network,
      actor_address: owner_address,
      inputs: {
        name: name,
        symbol: symbol,
        decimals: decimals,
        capacity_imbalance_fee_divisor: capacity_imbalance_fee_divisor,
        max_hops: max_hops
      },
      status: "applied"
    )
---
INSERT INTO `currency_networks` (`address`, `name`, `symbol`, `decimals`, `capacity_imbalance_fee_divisor`, `default_interest_rate`, `custom_interests`, `prevent_mediator_interests`, `max_hops`, `is_frozen`, `owner_address`, `created_at`, `updated_at`) VALUES ('0x0e1c345657aaee1911a4b0fee8000d5ad988a461', 'Growoperative Gardens (CAD)', 'GGRO', 2, 0, 0, FALSE, FALSE, 5, FALSE, '0x0000000000000000000000000000000000000001', '2026-04-16 00:36:33.879996', '2026-04-16 00:36:33.879996')
INSERT INTO `operations` (`operation_type`, `module_name`, `currency_network_id`, `actor_address`, `inputs`, `nonce`, `signature`, `idempotency_key`, `multi_hop_id`, `parent_operation_id`, `fee_amount`, `fee_currency`, `fee_distribution`, `status`, `created_at`, `updated_at`) VALUES ('deploy_network', 'trustline', 1, '0x0000000000000000000000000000000000000001', '{\"name\":\"Growoperative Gardens (CAD)\",\"symbol\":\"GGRO\",\"decimals\":2,\"capacity_imbalance_fee_divisor\":0,\"max_hops\":5}', NULL, NULL, NULL, NULL, NULL, 0.0, NULL, NULL, 'applied', '2026-04-16 00:36:33.911318', '2026-04-16 00:36:33.911318')