app/services/signature_verifier.rb

  def self.verify_by_address(payload:, signature:, address:)
    identity = Identity.find_by(address: address&.downcase)
---
SELECT `identities`.* FROM `identities` WHERE `identities`.`address` = '0xdbf5d07ca547343c8afb8695904f59244dea5af2' LIMIT 1