app/services/transfer_service.rb

INSERT INTO `trustline_events` (`operation_id`, `currency_network_id`, `event_type`, `from_address`, `to_address`, `value`, `extra_data`, `creditline_given`, `creditline_received`, `interest_rate_given`, `interest_rate_received`, `is_frozen`, `balance`, `path`, `fee_payer`, `total_fees`, `fees_paid`, `created_at`, `updated_at`) VALUES (21, 3, 'BalanceUpdate', '0x415a43fef7aad32be06284c471942b19d0b2e71b', '0x49994e201452109ad543faa41126f2f2fe601757', NULL, NULL, NULL, NULL, NULL, NULL, NULL, -4.0, NULL, NULL, NULL, NULL, '2026-04-16 01:33:22.653147', '2026-04-16 01:33:22.653147')
INSERT INTO `trustline_events` (`operation_id`, `currency_network_id`, `event_type`, `from_address`, `to_address`, `value`, `extra_data`, `creditline_given`, `creditline_received`, `interest_rate_given`, `interest_rate_received`, `is_frozen`, `balance`, `path`, `fee_payer`, `total_fees`, `fees_paid`, `created_at`, `updated_at`) VALUES (7, 2, 'Transfer', '0xb314f23affdf939eac159ac0ae3fb212b8d786cc', '0x60c2d5928e19d874c71b32f6048d851f98fb5340', 25.0, '{\"app\":\"growoperative\",\"order_id\":42}', NULL, NULL, NULL, NULL, NULL, NULL, '[\"0xb314f23affdf939eac159ac0ae3fb212b8d786cc\",\"0x60c2d5928e19d874c71b32f6048d851f98fb5340\"]', 'sender', 0.0, '[0.0]', '2026-04-16 00:38:15.675753', '2026-04-16 00:38:15.675753')
---
        fees_paid << hop_result[:fee].to_f

        # Emit BalanceUpdate event per hop
        events << TrustlineEvent.create!(
          operation: op,
          currency_network: network,
          event_type: "BalanceUpdate",
          from_address: hop_result[:sender],
          to_address: hop_result[:receiver],
          balance: canonical_new_balance
        )
      end

      # Emit Transfer event (endpoint to endpoint)
      transfer_event = TrustlineEvent.create!(
        operation: op,
        currency_network: network,
        event_type: "Transfer",
        from_address: sender_address,
        to_address: receiver_address,
        value: value,
        extra_data: extra_data,
        path: path,
        fee_payer: fee_payer,
        total_fees: result[:total_fees],
        fees_paid: fees_paid
      )