app/services/trustline_service.rb

        is_frozen: false
      }

      pending_request = trustline&.trustline_update_requests&.first
---
SELECT `trustline_update_requests`.* FROM `trustline_update_requests` WHERE `trustline_update_requests`.`trustline_id` = 1 ORDER BY `trustline_update_requests`.`id` ASC LIMIT 1

        new_received = creditor_is_a ? result[:new_state][:creditline_received] : result[:new_state][:creditline_given]

        if trustline
          trustline.update!(
            creditline_given: new_given,
            creditline_received: new_received,
            is_frozen: result[:new_state][:is_frozen]
          )
---
UPDATE `trustlines` SET `trustlines`.`creditline_given` = 100.0, `trustlines`.`creditline_received` = 50.0, `trustlines`.`updated_at` = '2026-04-16 00:38:15.646538' WHERE `trustlines`.`id` = 2

        pending_request&.destroy!

        # Record operation
        op = Operation.create!(
          operation_type: result[:action] == :accept_request ? "trustline_update_accept" : "trustline_update",
          module_name: "trustline",
          currency_network: network,
          actor_address: creditor_address,
          inputs: {
            creditor: creditor_address,
            debtor: debtor_address,
            creditline_given: creditline_given.to_f,
            creditline_received: creditline_received.to_f
          },
          status: "applied"
        )

        # Emit TrustlineUpdate event
        TrustlineEvent.create!(
          operation: op,
          currency_network: network,
          event_type: "TrustlineUpdate",
          from_address: creditor_address,
          to_address: debtor_address,
          creditline_given: creditline_given,
          creditline_received: creditline_received,
          is_frozen: false
        )
---
INSERT INTO `operations` (`operation_type`, `module_name`, `currency_network_id`, `actor_address`, `inputs`, `nonce`, `signature`, `idempotency_key`, `multi_hop_id`, `parent_operation_id`, `fee_amount`, `fee_currency`, `fee_distribution`, `status`, `created_at`, `updated_at`) VALUES ('trustline_update_accept', 'trustline', 2, '0xb314f23affdf939eac159ac0ae3fb212b8d786cc', '{\"creditor\":\"0xb314f23affdf939eac159ac0ae3fb212b8d786cc\",\"debtor\":\"0x60c2d5928e19d874c71b32f6048d851f98fb5340\",\"creditline_given\":50.0,\"creditline_received\":100.0}', NULL, NULL, NULL, NULL, NULL, 0.0, NULL, NULL, 'applied', '2026-04-16 00:38:15.651345', '2026-04-16 00:38:15.651345')
INSERT INTO `trustline_events` (`operation_id`, `currency_network_id`, `event_type`, `from_address`, `to_address`, `value`, `extra_data`, `creditline_given`, `creditline_received`, `interest_rate_given`, `interest_rate_received`, `is_frozen`, `balance`, `path`, `fee_payer`, `total_fees`, `fees_paid`, `created_at`, `updated_at`) VALUES (6, 2, 'TrustlineUpdate', '0xb314f23affdf939eac159ac0ae3fb212b8d786cc', '0x60c2d5928e19d874c71b32f6048d851f98fb5340', NULL, NULL, 50.0, 100.0, NULL, NULL, FALSE, NULL, NULL, NULL, NULL, NULL, '2026-04-16 00:38:15.653760', '2026-04-16 00:38:15.653760')

        { action: result[:action], trustline: trustline }

      when :create_request
        trustline ||= Foaf::TrustlineRecord.create!(
          currency_network: network,
          user_a_address: ordering[:user_a],
          user_b_address: ordering[:user_b],
          creditline_given: 0,
          creditline_received: 0,
          is_frozen: false
        )

        # Upsert the request
        req = trustline.trustline_update_requests.first_or_initialize
---
INSERT INTO `trustlines` (`currency_network_id`, `user_a_address`, `user_b_address`, `creditline_given`, `creditline_received`, `interest_rate_given`, `interest_rate_received`, `is_frozen`, `allow_routing`, `balance`, `balance_mtime`, `created_at`, `updated_at`) VALUES (1, '0x60c2d5928e19d874c71b32f6048d851f98fb5340', '0xb314f23affdf939eac159ac0ae3fb212b8d786cc', 0.0, 0.0, 0, 0, FALSE, TRUE, 0.0, 0, '2026-04-16 00:36:34.009586', '2026-04-16 00:36:34.009586')
SELECT `trustline_update_requests`.* FROM `trustline_update_requests` WHERE `trustline_update_requests`.`trustline_id` = 1 ORDER BY `trustline_update_requests`.`id` ASC LIMIT 1

        req.save!

        # Record operation
        op = Operation.create!(
          operation_type: "trustline_update_request",
          module_name: "trustline",
          currency_network: network,
          actor_address: creditor_address,
          inputs: {
            creditor: creditor_address,
            debtor: debtor_address,
            creditline_given: creditline_given.to_f,
            creditline_received: creditline_received.to_f
          },
          status: "applied"
        )

        # Emit TrustlineUpdateRequest event
        TrustlineEvent.create!(
          operation: op,
          currency_network: network,
          event_type: "TrustlineUpdateRequest",
          from_address: creditor_address,
          to_address: debtor_address,
          creditline_given: creditline_given,
          creditline_received: creditline_received,
          is_frozen: false
        )
---
INSERT INTO `trustline_update_requests` (`trustline_id`, `creditline_given`, `creditline_received`, `interest_rate_given`, `interest_rate_received`, `is_frozen`, `initiator_address`, `created_at`, `updated_at`) VALUES (1, 100.0, 0.0, 0, 0, FALSE, '0x60c2d5928e19d874c71b32f6048d851f98fb5340', '2026-04-16 00:36:34.054444', '2026-04-16 00:36:34.054444')
INSERT INTO `operations` (`operation_type`, `module_name`, `currency_network_id`, `actor_address`, `inputs`, `nonce`, `signature`, `idempotency_key`, `multi_hop_id`, `parent_operation_id`, `fee_amount`, `fee_currency`, `fee_distribution`, `status`, `created_at`, `updated_at`) VALUES ('trustline_update_request', 'trustline', 1, '0x60c2d5928e19d874c71b32f6048d851f98fb5340', '{\"creditor\":\"0x60c2d5928e19d874c71b32f6048d851f98fb5340\",\"debtor\":\"0xb314f23affdf939eac159ac0ae3fb212b8d786cc\",\"creditline_given\":100.0,\"creditline_received\":0.0}', NULL, NULL, NULL, NULL, NULL, 0.0, NULL, NULL, 'applied', '2026-04-16 00:36:34.057723', '2026-04-16 00:36:34.057723')
INSERT INTO `trustline_events` (`operation_id`, `currency_network_id`, `event_type`, `from_address`, `to_address`, `value`, `extra_data`, `creditline_given`, `creditline_received`, `interest_rate_given`, `interest_rate_received`, `is_frozen`, `balance`, `path`, `fee_payer`, `total_fees`, `fees_paid`, `created_at`, `updated_at`) VALUES (2, 1, 'TrustlineUpdateRequest', '0x60c2d5928e19d874c71b32f6048d851f98fb5340', '0xb314f23affdf939eac159ac0ae3fb212b8d786cc', NULL, NULL, 100.0, 0.0, NULL, NULL, FALSE, NULL, NULL, NULL, NULL, NULL, '2026-04-16 00:36:34.085651', '2026-04-16 00:36:34.085651')