app/controllers/api/v1/api_controller.rb

      def find_network!
        @network = CurrencyNetwork.find_by!(address: params[:network_address] || params[:address])
---
SELECT `currency_networks`.* FROM `currency_networks` WHERE `currency_networks`.`address` = '0x9639bd192db350590799561328d1d7d1c2375e0a' LIMIT 1