app/controllers/api/v1/networks_controller.rb

      def index
        networks = CurrencyNetwork.all
        render json: networks.map { |n| serialize_network(n) }
---
SELECT `currency_networks`.* FROM `currency_networks`