app/controllers/api/v1/pending_transfers_controller.rb

SELECT `currency_networks`.* FROM `currency_networks` WHERE `currency_networks`.`address` = '0xe4ed4f554a5a1d48632b488192fe503188591004' LIMIT 1
INSERT INTO `pending_transfers` (`currency_network_id`, `from_address`, `to_address`, `value`, `max_fee`, `fee_payer`, `path`, `extra_data`, `status`, `rejected_reason`, `confirmed_at`, `resolved_at`, `nonce`, `signature`, `created_at`, `updated_at`) VALUES (8, '0x050852bb235cafb6771cc1d191e206ed39222f0f', '0x3ab3a1e7a954df465158577231ee401d09cb8791', 8.0, 0.0, 'sender', NULL, '{\"app\":\"growoperative\",\"description\":\"Settlement for Order 100190\",\"order_id\":100190,\"order_label\":\"Order 100190\",\"mirrored_at\":\"2026-04-16T06:15:49Z\"}', 'pending', NULL, NULL, NULL, NULL, NULL, '2026-04-16 06:15:49.660397', '2026-04-16 06:15:49.660397')
---
      def create
        return unless verify_signature!(params[:from_address])

        network = CurrencyNetwork.find_by!(address: params[:network_address])

        pt = PendingTransfer.create!(
          currency_network: network,
          from_address: params[:from_address],
          to_address: params[:to_address],
          value: BigDecimal(params[:value].to_s),
          max_fee: BigDecimal((params[:max_fee] || 0).to_s),
          fee_payer: params[:fee_payer] || "sender",
          path: params[:path],
          extra_data: params[:extra_data],
          status: "pending"
        )

SELECT `pending_transfers`.* FROM `pending_transfers` WHERE `pending_transfers`.`id` = 1 LIMIT 1
---
      def confirm
        pt = PendingTransfer.find(params[:id])