app/controllers/api/v1/trustline_updates_controller.rb

SELECT `currency_networks`.* FROM `currency_networks` WHERE `currency_networks`.`address` = '0x0e3f47e20bc8c223566fc48a150d28bbd31b96a6' LIMIT 1
UPDATE `trustlines` SET `trustlines`.`creditline_received` = 30.0, `trustlines`.`updated_at` = '2026-04-16 14:40:54.474828' WHERE `trustlines`.`id` = 32
---
      def create
        return unless verify_signature!(params[:creditor_address])

        network = CurrencyNetwork.find_by!(address: params[:network_address])

        result = TrustlineService.update_trustline(
          network: network,
          creditor_address: params[:creditor_address],
          debtor_address: params[:debtor_address],
          creditline_given: BigDecimal(params[:creditline_given].to_s),
          creditline_received: BigDecimal(params[:creditline_received].to_s)
        )