app/models/protocol_parameter.rb

SELECT `protocol_parameters`.* FROM `protocol_parameters` WHERE `protocol_parameters`.`key` = 'signature_enforcement' LIMIT 1
---
  def self.get(key, default: nil)
    find_by(key: key)&.value || default